una1veritas/Workspace/stm32f4-usart/main.c
/*
 * main.cpp
 *
 *  Created on: 2012/10/08
 *      Author: sin
 */

#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <stm32f4xx.h>

//#include "stm32f4xx_it.h"

#include "gpio.h"
//#include "systick.h"
#include "delay.h"
#include "usart.h"

int main(void) {
	uint16_t bits;
	uint32_t intval = 24;
	uint32_t tnow;
	char tmp[92];

	TIM2_timer_start();
//	SysTick_Start();

	usart_begin(USART2Serial, PA3, PA2, 19200);
	usart_print(USART2Serial, "Happy are those who know they are spiritually poor; \n");
	usart_print(USART2Serial, "The kingdom of heaven belongs to them!\n");
	usart_print(USART2Serial, "How many eyes does Mississipi river have?\n");
	usart_print(USART2Serial, "Quick brown fox jumped over the lazy dog!\n");
	usart_flush(USART2Serial);

	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);

	sprintf(tmp, "SYSCLK = %ld, ", RCC_Clocks.SYSCLK_Frequency);
	usart_print(USART2Serial, tmp);
	sprintf(tmp, "HCLK = %ld, ", RCC_Clocks.HCLK_Frequency);
	usart_print(USART2Serial, tmp);
	sprintf(tmp, "PCLK1 = %ld, ", RCC_Clocks.PCLK1_Frequency);
	usart_print(USART2Serial, tmp);
	sprintf(tmp, "PCLK2 = %ld\r\n", RCC_Clocks.PCLK2_Frequency);
	usart_print(USART2Serial, tmp);
//	usart_flush(USART2Serial);

	GPIOMode(GPIOD, (GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15),
			GPIO_Mode_OUT, LOWSPEED, GPIO_OType_PP, GPIO_PuPd_NOPULL);
	/*
	pinMode(PD12, OUTPUT);
	pinMode(PD13, OUTPUT);
	pinMode(PD14, OUTPUT);
	pinMode(PD15, OUTPUT);
	| GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15),
			GPIO_Mode_OUT, GPIO_Speed_50MHz, GPIO_OType_PP, GPIO_PuPd_NOPULL);
*/
	tnow = millis()/1000;
	while (tnow == millis()/1000);
	tnow = millis()/1000;

	while (1) {
		bits = GPIO_ReadOutputData(GPIOD);
		bits = 1<<12 | (bits & 0x0fff);
		GPIO_Write(GPIOD, bits);
		delay_millis(intval);

		bits = 1<<13 | (bits & 0x0fff);
		GPIO_Write(GPIOD, bits);
		delay_millis(intval);

		bits = 1<<14 | (bits & 0x0fff);
		GPIO_Write(GPIOD, bits);
		delay_millis(intval);

		bits = 1<<15 | (bits & 0x0fff);
		GPIO_Write(GPIOD, bits);
		delay_millis(intval);
		//
		bits = 1<<12 | (bits & 0x0fff);
		GPIO_Write(GPIOD, bits);

		while (tnow == millis()/1000);
		tnow = millis()/1000;
/*
		usart3.print((float)(count++ / 32.0f), 3);
		*/
//		uint16_t h, t;
//		h = tx_head();
//		t = tx_tail();
		sprintf(tmp, /*"head =% 4d, tail =% 4d,*/ "%04ld\n", millis());
		usart_print(USART2Serial, tmp);
		/*
		dval = (uint32) (100.0f + 64*sinf( (count % (uint32)(3.14159 * 2 * 32))/32.0f));
		usart3.println(dval);
		*/
		uint16_t i = 0;
		if ( usart_available(USART2Serial) > 0 ) {
			while ( usart_available(USART2Serial) > 0 && i < 92 ) {
				tmp[i++] = (char) usart_read(USART2Serial);
			}
			tmp[i] = 0;
			usart_print(USART2Serial, "> ");
			usart_print(USART2Serial, tmp);
			usart_print(USART2Serial, "\n");
		}
	}
	return 0;
}

